// lesson13_02.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
#include <Windows.h>

struct account
{
    unsigned int Number;
    std::string Name;
    int Balace;
};

int main()
{
    setlocale(LC_ALL, "RUS");
    SetConsoleCP(1251);

    account person;

    std::cout << "Введите номер счёта: ";
    std::cin >> person.Number;
    std::cout << "Введите имя владельца: ";
    std::cin >> person.Name;
    std::cout << "Введите баланс: ";
    std::cin >> person.Balace;
    std::cout << "Введите новый баланс: ";
    std::cin >> person.Balace;

    std::cout << "Ваш счёт: " << person.Name << ", " << person.Number << ", " << person.Balace;

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
